tap "homebrew/cask"
# ANSI HTML adapter
brew "aha"
# Emacs dependency management
brew "cask"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Configurable static site generator
brew "hugo"
# Fast, highly customisable system info script
brew "neofetch"
# Formatting tool for reformatting Swift code
brew "swiftformat"
# Official bilibili video streaming and sharing platform
cask "bilibili"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Desktop client that supports multiple LLM providers
cask "cherry-studio"
# Voice and text chat software
cask "discord"
# Display control utility
cask "display-pilot"
# App to build and share containerised applications and microservices
cask "docker-desktop"
cask "font-intel-one-mono"
cask "font-maple-mono"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Tools to protect your files
cask "gpg-suite-no-mail"
# Cross-device interconnection service for the Xiaomi ecosystem
cask "hyperconnect"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# File archiver
cask "keka"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Minimal installer for conda
cask "miniconda"
# Minecraft modding platform
cask "modrinth"
# Open-source download manager
cask "motrix"
# Virtual machine client
cask "omnissa-horizon-client"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# System monitor for the menu bar
cask "stats"
# Network toolbox
cask "surge"
# Web browser focusing on security
cask "tor-browser"
# PKG software package uninstall tool
cask "uninstallpkg"
# Open-source code editor
cask "visual-studio-code"
# Native desktop client for WhatsApp
cask "whatsapp"
# Application for generating TOTP and HOTP codes
cask "yubico-authenticator"
# OpenJDK distribution from Azul
cask "zulu@21"
vscode "alefragnani.project-manager"
vscode "chadalen.vscode-jetbrains-icon-theme"
vscode "davidanson.vscode-markdownlint"
vscode "docsmsft.docs-markdown"
vscode "edwinsulaiman.jetbrains-rider-dark-theme"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "gruntfuggly.todo-tree"
vscode "isudox.vscode-jetbrains-keybindings"
vscode "kameshkotwani.google-search"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "redhat.vscode-yaml"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "wmanth.jar-viewer"
