tap "homebrew/cask"
tap "minio/aistor"
tap "tw93/tap"
# Emacs dependency management
brew "cask"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GitHub command-line tool
brew "gh"
# Turn movies into GIFs
brew "gifify"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Rsync for cloud storage
brew "rclone"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Tool for managing your YubiKey configuration
brew "ykman"
# Find security issues in GitHub Actions setups
brew "zizmor"
# Comprehensive macOS cleanup and application uninstall tool
brew "tw93/tap/mole"
# AI Coding Agent IDE
cask "antigravity"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Video editing and image design platform
cask "capcut"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Desktop client that supports multiple LLM providers
cask "cherry-studio"
# Voice and text chat software
cask "discord"
# Display control utility
cask "display-pilot"
# AI-powered email client designed for Gmail
cask "filo"
cask "font-intel-one-mono"
cask "font-maple-mono"
cask "font-noto-color-emoji"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Tools to protect your files
cask "gpg-suite-no-mail"
# Free and open-source media player
cask "iina"
# JetBrains tools manager
cask "jetbrains-toolbox"
# File archiver
cask "keka"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Minimal installer for conda
cask "miniconda"
# Minecraft modding platform
cask "modrinth"
# Open-source download manager
cask "motrix"
# Virtual machine client
cask "omnissa-horizon-client"
# Replacement for Docker Desktop
cask "orbstack"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# System monitor for the menu bar
cask "stats"
# Network toolbox
cask "surge"
# Web browser focusing on security
cask "tor-browser"
# PKG software package uninstall tool
cask "uninstallpkg"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# Application for generating TOTP and HOTP codes
cask "yubico-authenticator"
# Multiplayer code editor
cask "zed"
vscode "akamud.vscode-theme-onedark"
vscode "alefragnani.project-manager"
vscode "angular.ng-template"
vscode "chadalen.vscode-jetbrains-icon-theme"
vscode "digimezzo.jetbrains-rider-new-ui-theme"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "gruntfuggly.todo-tree"
vscode "k--kato.intellij-idea-keybindings"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "pdconsec.vscode-print"
vscode "redhat.vscode-yaml"
vscode "unifiedjs.vscode-mdx"
