# ANSI HTML adapter
brew "aha"
# Emacs dependency management
brew "cask"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GitHub command-line tool
brew "gh"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Rsync for cloud storage
brew "rclone"
# Formatting tool for reformatting Swift code
brew "swiftformat"
# Tool for managing your YubiKey configuration
brew "ykman"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Desktop client that supports multiple LLM providers
cask "cherry-studio"
# Voice and text chat software
cask "discord"
# Display control utility
cask "display-pilot"
# App to build and share containerised applications and microservices
cask "docker-desktop"
cask "font-intel-one-mono"
cask "font-maple-mono"
cask "font-noto-color-emoji"
# Web browser
cask "google-chrome"
# Tools to protect your files
cask "gpg-suite-no-mail"
# Cross-device interconnection service for the Xiaomi ecosystem
cask "hyperconnect"
# Free and open-source media player
cask "iina"
# JetBrains tools manager
cask "jetbrains-toolbox"
# File archiver
cask "keka"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Minimal installer for conda
cask "miniconda"
# Minecraft modding platform
cask "modrinth"
# Open-source download manager
cask "motrix"
# Virtual machine client
cask "omnissa-horizon-client"
# Minecraft launcher
cask "prismlauncher"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# System monitor for the menu bar
cask "stats"
# Network toolbox
cask "surge"
# Web browser focusing on security
cask "tor-browser"
# PKG software package uninstall tool
cask "uninstallpkg"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# Native desktop client for WhatsApp
cask "whatsapp"
# Application for generating TOTP and HOTP codes
cask "yubico-authenticator"
# Multiplayer code editor
cask "zed"
vscode "alefragnani.project-manager"
vscode "chadalen.vscode-jetbrains-icon-theme"
vscode "digimezzo.jetbrains-rider-new-ui-theme"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "gruntfuggly.todo-tree"
vscode "isudox.vscode-jetbrains-keybindings"
vscode "kameshkotwani.google-search"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "redhat.vscode-yaml"
vscode "unifiedjs.vscode-mdx"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
