tap "gm-vm/repo"
tap "homebrew/cask"
tap "minio/aistor"
tap "tw93/tap"
# Emacs dependency management
brew "cask"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Turn movies into GIFs
brew "gifify"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast, Dynamic Programming Language
brew "julia"
# Another rule-based tunnel in Go, formerly known as ClashMeta
brew "mihomo"
# Open client for Cisco AnyConnect VPN
brew "openconnect"
# Fast, disk space efficient package manager
brew "pnpm"
# Rsync for cloud storage
brew "rclone"
# Markup-based typesetting system
brew "typst"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Tool for managing your YubiKey configuration
brew "ykman"
# Find security issues in GitHub Actions setups
brew "zizmor"
# Comprehensive macOS cleanup and application uninstall tool
brew "tw93/tap/mole"
# AI Coding Agent IDE
cask "antigravity"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Official bilibili video streaming and sharing platform
cask "bilibili"
# Display control utility
cask "display-pilot"
# Launcher for *Epic Games* games
cask "epic-games"
# AI-powered email client designed for Gmail
cask "filo"
cask "font-intel-one-mono"
cask "font-maple-mono"
cask "font-noto-color-emoji"
cask "font-noto-sans"
cask "font-noto-sans-cjk"
cask "font-noto-serif"
cask "font-noto-serif-sc"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Tools to protect your files
cask "gpg-suite-no-mail"
# Free and open-source media player
cask "iina"
# JetBrains tools manager
cask "jetbrains-toolbox"
# File archiver
cask "keka"
# Full TeX Live distribution without GUI applications
cask "mactex-no-gui"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Minimal installer for conda
cask "miniconda"
# Minecraft modding platform
cask "modrinth"
# Open-source download manager
cask "motrix"
# App to write, plan, collaborate, and get organised
cask "notion"
# Virtual machine client
cask "omnissa-horizon-client"
# Replacement for Docker Desktop
cask "orbstack"
# Minecraft launcher
cask "prismlauncher"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# System monitor for the menu bar
cask "stats"
# Network toolbox
cask "surge"
# Web browser focusing on security
cask "tor-browser"
# Open-source code editor
cask "visual-studio-code"
# Full-featured companion app to the YubiKey
cask "yubico-authenticator"
# Multiplayer code editor
cask "zed"
vscode "akamud.vscode-theme-onedark"
vscode "alefragnani.project-manager"
vscode "angular.ng-template"
vscode "chadalen.vscode-jetbrains-icon-theme"
vscode "digimezzo.jetbrains-rider-new-ui-theme"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "gruntfuggly.todo-tree"
vscode "k--kato.intellij-idea-keybindings"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "pdconsec.vscode-print"
vscode "redhat.vscode-yaml"
vscode "unifiedjs.vscode-mdx"
